Revit 2027 API
IPipeFittingAndAccessoryPressureDropServer.IsApplicable Method
 Check if the server is applicable for the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool IsApplicable(
	PipeFittingAndAccessoryPressureDropData data
)
Function IsApplicable (
	data As PipeFittingAndAccessoryPressureDropData
) As Boolean
bool IsApplicable(
	PipeFittingAndAccessoryPressureDropData^ data
)
abstract IsApplicable :
        data : PipeFittingAndAccessoryPressureDropData -> bool
Parameters
data PipeFittingAndAccessoryPressureDropData
 The input data of the calculation.
Return Value
Boolean
See Also
Reference
IPipeFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace